<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="css/style.css">
    <link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
    <script src="js/script.js"></script>
    <title>3.3.1 Lenguajes para bases de datos</title>
</head>

<body>
    <div id="main_container">
        <div id="gradient"></div>
        <nav class="w3-bar nav_bar">
            <a class="w3-bar-item w3-mobile" href="index.html">
                <span><i class="fa fa-arrow-left"></i> Regresar</span>
            </a>
        </nav>
        <aside class="w3-bar-block w3-cell" style="width:130px">
            <button class="w3-bar-item w3-button tablink ribbon stabilo_purple" onclick="openLink(event, 'Fade')">
                <span>
                    ¿Qu&eacute; es una base de datos?
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_blue" onclick="openLink(event, 'Left')">
                <span>
                    Lenguajes para Bases de Datos
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_green" onclick="openLink(event, 'Right')">
                <span>
                   Niveles de abstracci&oacute;n
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_pink " onclick="openLink(event, 'Top')">
                <span>
                    El modelo relacional
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_yellow" onclick="openLink(event, 'Bottom')">
                <span>
                    SQL
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_melon" onclick="openLink(event, 'DDL')">
                <span>
                    DDL en SQL
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_blue" onclick="openLink(event, 'DML')">
                <span>
                    DML en SQL
                </span>
            </button>
            <button class="w3-bar-item w3-button tablink ribbon stabilo_green" onclick="openLink(event, 'Zoom')">
                <span>
                    Ejemplo
                </span>
            </button>
        </aside>
        <div id="interaction_panel" class="w3-cell">
            <div class="w3-center" id="info_panel">
                <div class="w3-container w3-padding">Selecciona los temas en el men&uacute; de la izquierda</div>

                <div id="Fade" class="w3-container city w3-animate-left" style="display:none">
                    <h2>¿Qu&eacute; es una base de datos?</h2>
                    <p class="w3-justify">
                        En su forma m&aacute;s simple, es un archivo de registros o <i>entidades</i>, tal como un cat&aacute;logo de tarjetas de biblioteca. Es persistente en el sentido que tanto sus entidades como las relaciones entre ellas son preservadas
                        de un uso al siguiente.
                    </p>
                    <p class="w3-justify">
                        Oracle define a las bases de datos como

                        <blockquote class="w3-justify">
                            Una base de datos es una recopilación organizada de información o datos estructurados, que normalmente se almacena de forma electrónica en un sistema informático. Normalmente, una base de datos está controlada por un sistema de gestión de bases de datos
                            (DBMS). En conjunto, los datos y el DBMS, junto con las aplicaciones asociadas a ellos, reciben el nombre de sistema de bases de datos, abreviado normalmente a simplemente base de datos.
                        </blockquote>
                    </p>
                    <img src="https://www.hostname.cl/uploads/2020/11/BD.png" alt="Bases de datos" class="figure">
                </div>

                <div id="Left" class="w3-container city w3-animate-left" style="display:none">
                    <h2>Lenguajes para Bases de Datos</h2>
                    <p class="w3-justify">Tambi&eacute;n son llamados <i>lenguajes de sistemas de datos</i> o DLS (<i>data system languages</i>). Los DSL soportan a menudo dos sublenguajes: el <i>lenguaje de definici&oacute;n de datos, o DDL (<i>data definition language</i>)
                        y el lenguaje de manipulaci&oacute;n de datos, o DML (<i>data manipulation language</i>)</i>
                    </p>

                    <p class="w3-justify">
                        El DDL es un lenguaje para describir los datos y sus relaciones en una base de datos. Se puede generar en un script de objetos de base de datos para:
                        <ul class="w3-justify">
                            <li>Mantener una instant&aacute;nea de la estructura de base de datos</li>
                            <li>COnfigurar un sistema de prueba donde la base de datos act&uacute;e como el sistema de producci&oacute;n, pero sin contener datos</li>
                            <li>Producir plantillas para los nuevos objetos que se creen bas&aacute;ndose en los existentes</li>
                        </ul>
                    </p>

                    <p class="w3-justify">Por su parte, el DML soporta (al menos) operaciones para examinar, insertar, eliminar y modificar datos. Adem&aacute;s, a menudo el DML tiene un lenguaje de consulta, el cual es amigable con el usuario, orientado a la pantalla, interactivo
                        y relativamente f&aacute;cil de utilizar. Tanto el DDL pueden estar integrados en un lenguaje anfitri&oacute;n, tal como Pascal (Pascal /R), COBOL (SQL) o FORTRAN (DL/I)</p>

                </div>

                <div id="Right" class="w3-container city w3-animate-left" style="display:none">
                    <h2>Niveles de abstracci&oacute;n</h2>
                    <div class="w3-cell-row">
                        <div class="w3-cell w3-center">
                            <span>&nbsp;</span> <img src="img/niveles-de-abs.jpg" class="figure" alt="Niveles de abstracci&oacute;n en un sistema de base de datos">
                            <span>&nbsp;</span>
                        </div>
                        <div class="w3-cell w3-justify w3-padding">
                            <p>En el nivel m&aacute;s bajo est&aacute; la <i>vista f&iacute;sica</i>, que describe los discos o tambores f&iacute;sicos reales donde est&aacute;n almacenados los datos.</p>
                            <p>En el siguiente nivel superior est&aacute; la <i>vista de almacenamiento</i>, que proporciona una estructura a los propios datos f&iacute;sicos.</p>
                            <p>El siguiente nivel de abstracci&oacute;n es la <i>vista conceptual</i>, que describe c&oacute;mo se organizan los datos.</p>
                            <p>Finalmente, hay posiblemente varias <i>vistas externas</i> para una base de datos. Estas vistas son observadas y empleadas por el usuario, con frecuencia a trav&eacute;s del lenguaje de consulta.</p>

                        </div>
                    </div>
                </div>

                <div id="Top" class="w3-container city w3-animate-left" style="display:none">
                    <h2>El modelo relacional</h2>
                    <p class="w3-justify">
                        El modelo relacional proporcionó una forma estándar de representar y consultar datos que podía utilizarse en cualquier aplicación. Desde el principio, los desarrolladores se dieron cuenta de que la virtud principal del modelo de base de datos relacional
                        era el uso de tablas, ya que era una forma intuitiva, eficiente y flexible de almacenar y acceder a información estructurada.
                    </p>
                    <p class="w3-justify">
                        El modelo relacional define la implementación lógica de la información del negocio mediante una serie de tablas, campos, restricciones, relaciones entre las mismas, etc… que deben reflejar la semántica del negocio. Esta semántica es captada por el área
                        TI y descrita en los sistemas de gestión de bases de datos,
                    </p>
                </div>

                <div id="Bottom" class="w3-container city w3-animate-left" style="display:none">
                    <h2>SQL</h2>
                    <p class="w3-justify">SQL viene de las siglas <i>Structured Query Language</i> (Lenguaje de consulta Estructurado). Sus fundamentos son una combinaci&oacute;n de &aacute;lgebra y de c&aacute;lculo relacionales. Su importancia radica en que ha sido estandarizado
                        por el American National Standards Institute y la International Standards Organization</p>
                    <p class="w3-justify">
                        La publicaci&oacute;n de un &eacute;standar tiene muchas ventajas, ya que hace que las aplicaciones sean transportables de una m&aacute;quina a otra y puedan utilizarse por mucho tiempo; los sistemas puedan comunicarse de uno a otro, y los clientes pueden
                        elegir la versi&oacute;n completa o un subconjunto del mismo lenguaje, seg&uacute;n sea necesario.
                    </p>
                    <img src="http://2.bp.blogspot.com/_-BCHr5tNQPY/S9cg-JNgKnI/AAAAAAAAAGo/AISz7nqPbY4/s1600/Dibujo9.bmp" alt="SQL" class="figure-50">
                </div>

                <div id="DDL" class="w3-container city w3-animate-left" style="display:none">
                    <h2>DDL en SQL</h2>
                    <p class="w3-justify">
                        Como se ha mencionado, DDL (Data Definition Language) es el conjunto de instrucciones agrupadas en un lenguaje que nos permite definir las estructuras que almacenar&aacute;n los datos as&iacute; como los procedimientos y funciones que permitir&aacute;n
                        consultarlos.
                    </p>
                    <p class="w3-justify">
                        Para definir las estructura en SQL existen tres sentencias:
                        <ul class="w3-justify">
                            <li><b>CREATE</b>: se utiliza para crear una base de datos, una tabla, una vista, etc.</li>
                            <li><b>ALTER</b>: se utiliza para modificar la estructura, por ejemplo, a&ntilde;adir o borrar columnas de una tabla.</li>
                            <li><b>DROP:</b> con esta sentencia, se pueden eliminar objetos de la estructura, como pueden ser tablas.</li>
                        </ul>
                    </p>
                </div>

                <div id="DML" class="w3-container city w3-animate-left" style="display:none">
                    <h2>DML en SQL</h2>
                    <p class="w3-justify">
                        Como ya se mencion&oacute;, Data Manipulation Language (DML) se resume en el conjunto de instrucciones SQL que permite a los usuarios introducir datos para posteriormente realizar tareas de consultas o modificación de los datos que contienen las Bases
                        de Datos.
                    </p>
                    <p class="w3-justify">
                        Los elementos que se utilizan para manipular los datos en SQL son los siguientes:
                        <ul class="w3-justify">
                            <li><b>INSERT</b>: inserta registros o filas en una tabla.</li>
                            <li><b>SELECT</b>: muestra iunformaci&oacute;n sobre los datos almacenados en la base de datos, que puede pertenecer a una o varias tablas.</li>
                            <li><b>UPDATE</b>: Actualiza informaci&oacute;n de una tabla.</li>
                            <li><b>DELETE</b>: Borra registros o filas de una tabla.</li>
                        </ul>
                    </p>
                </div>

                <div id="Zoom" class="w3-container city w3-animate-left" style="display:none">
                    <h2>Ejemplo</h2>
                    <p class="w3-justify">
                        Para este ejemplo, imaginemos que somos due&ntilde;os de una tienda que vende productos varios, y queremos llevar un registro de todos los productos que vendemos. Entonces tendremos que crear una tabla que registre los productos, por ejemplo:
                    </p>
                    <table class="w3-table w3-striped w3-border w3-centered">
                        <tr class="w3-blue">
                            <th>Producto</th>
                            <th>Precio</th>
                            <th>Cantidad en stock</th>
                        </tr>
                        <tr>
                            <td>Galletas</td>
                            <td>$15</td>
                            <td>10</td>
                        </tr>
                        <tr>
                            <td>Ligas para el cabello</td>
                            <td>$10</td>
                            <td>5</td>
                        </tr>
                        <tr>
                            <td>Audifonos</td>
                            <td>$30</td>
                            <td>12</td>
                        </tr>
                    </table>
                    <p class="w3-justify">
                        Ahora imaginemos que tambi&eacute;n deseamos llevar un registro de las categor&iacute;as de productos que vendemos
                    </p>
                    <table class="w3-table w3-striped w3-border w3-centered">
                        <tr class="w3-blue">
                            <th>Categoria</th>
                        </tr>
                        <tr>
                            <td>Abarrotes</td>
                        </tr>
                        <tr>
                            <td>Belleza</td>
                        </tr>
                        <tr>
                            <td>electrónica</td>
                        </tr>
                    </table>
                    <p class="w3-justify">
                        En un modelo relacional, se puede ver gr&aacute;ficamente el ejemplo descrito anteriormente en un diagrama llamado Entidad-Relaci&oacute;n, de la siguiente manera
                    </p>
                    <img src="img/ejemplo-bd.png" class="figure" alt="Modelo relacional">

                    <p class="w3-justify">
                        El diagrama es simple, los rectangulos representan todas aquellas <i>Entidades</i> que forman parte del negocio que se est&aacute; modelando, mientras que el rombo representa la <i>Relaci&oacute;n</i> que existe entre las entidades.
                        En este caso, el diagrama se puede leer como que la entidad <b>Producto</b> tiene una <b>Categor&iacute;a.</b>
                    </p>
                    <p class="w3-justify">
                        A partir de este diagrama, se puede dise&ntilde;ar una base de datos:
                        <ol class="w3-justify">
                            <li>Se crea la base de datos</li>
                            <li>Se crea una tabla llamada Producto, con los campos que se quieran guardar
                            </li>
                            <li>Se crea una tabla llamada Categoria, con sus respectivos campos</li>
                            <li>Se crea una tercera tabla <i>Tiene</i> que servir&aacute; para relacionar los registros de ambas tablas</li>
                        </ol>
                        <table class="w3-table w3-striped w3-border w3-centered">
                            <tr class="w3-blue">
                                <th>Producto</th>
                                <th>Categoria</th>
                            </tr>
                            <tr>
                                <td>Galletas</td>
                                <td>Abarrotes</td>

                            </tr>
                            <tr>
                                <td>Ligas para el cabello</td>
                                <td>Belleza</td>

                            </tr>
                            <tr>
                                <td>Audifonos</td>
                                <td>Electr&oacute;nica</td>
                            </tr>
                        </table>
                    </p>


                    <blockquote class="w3-justify"><b>Nota: </b>Los campos de la tabla <b>Tiene</b> deben ser identificadores &uacute;nicos de las tablas que est&aacute; relacionando. En este caso, la tabla podr&iacute;a formarse con el campo "Producto" de la tabla Producto y el campo
                        "Categoria" de la clase categoria, pero tambi&eacute;n podria agregarse un campo adicional a ambas tablas que funcione como un ID &uacute;nico. De manera que las tablas quedar&iacute;n de la siguiente manera.</blockquote>

                    <p>Tabla Producto</p>
                    <table class="w3-table w3-striped w3-border w3-centered">
                        <tr class="w3-blue">
                            <th class="w3-light-green">ID del producto</th>
                            <th>Producto</th>
                            <th>Precio</th>
                            <th>Cantidad en stock</th>
                        </tr>
                        <tr>
                            <td>PROD1</td>
                            <td>Galletas</td>
                            <td>$15</td>
                            <td>10</td>
                        </tr>
                        <tr>
                            <td>PROD2</td>
                            <td>Ligas para el cabello</td>
                            <td>$10</td>
                            <td>5</td>
                        </tr>
                        <tr>
                            <td>PROD3</td>
                            <td>Audifonos</td>
                            <td>$30</td>
                            <td>12</td>
                        </tr>
                    </table>

                    <p>Tabla Categoria</p>

                    <table class="w3-table w3-striped w3-border w3-centered">
                        <tr class="w3-blue">
                            <th class="w3-light-green">ID de categoria</th>
                            <th>Categoria</th>
                        </tr>
                        <tr>
                            <td>CAT1</td>
                            <td>Abarrotes</td>

                        </tr>
                        <tr>
                            <td>CAT2</td>
                            <td>Belleza</td>

                        </tr>
                        <tr>
                            <td>CAT3</td>
                            <td>Electr&oacute;nica</td>
                        </tr>
                    </table>
                    <p>Tabla Tiene</p>
                    <table class="w3-table w3-striped w3-border w3-centered">
                        <tr class="w3-blue">
                            <th>ID de producto</th>
                            <th>ID de categoria</th>
                        </tr>
                        <tr>
                            <td>PROD1</td>
                            <td>CAT1</td>

                        </tr>
                        <tr>
                            <td>PROD2</td>
                            <td>CAT2</td>

                        </tr>
                        <tr>
                            <td>PROD3</td>
                            <td>CAT3</td>
                        </tr>
                    </table>
                    <p class="w3-justify">Es posible que sea menos intuitiva la tabla Tiene, pero cuando se tienen grandes cantidades de datos es mejor organizarlo de esta manera para que no existan errores o referencias err&oacute;neas</p>
                </div>

            </div>

        </div>
    </div>
</body>

</html>